# Taps
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask '1password'
#cask 'caffeine'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
#cask 'helo'
#cask 'herd'
cask 'httpie'
cask 'imageoptim'
#cask 'pastebot'
#cask 'readdle-spark'
#cask 'screenflow'
cask 'slack'
#cask 'tableplus'
#cask 'telegram-desktop'
cask 'the-unarchiver'
#cask 'tinkerwell'
#cask 'transmit'
#cask 'tunnelbear'
#cask 'tuple'
cask 'visual-studio-code'
#cask 'zoom'
cask 'alt-tab'
cask 'rectangle'
cask 'warp'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
#mas 'Byword', id: 420212497
#mas 'Giphy Capture', id: 668208984
#mas 'Keynote', id: 409183694
#mas 'MyWoosh', id: 1498889644
#mas 'Numbers', id: 409203825
#mas 'Speedtest', id: 1153157709
#mas 'Spring', id: 1508706541
#mas 'Things', id: 904280696
