# Taps
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bash-completion2'
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'wget'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'tree'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'openssh'
brew 'php'

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask 'openkey'
cask '1password'
#cask 'caffeine'
cask 'figma'
cask 'canva'
cask 'dropbox'
cask 'google-drive'
cask 'slack'
cask 'firefox'
cask 'google-chrome'
cask 'the-unarchiver'
cask 'alt-tab'
cask 'rectangle'
cask 'raycast'
#cask 'helo'
#cask 'herd'
#cask 'readdle-spark'
cask 'docker'
cask 'postman'
cask 'httpie'
# cask 'tableplus'
cask 'dbeaver-community'
cask 'obsidian'
cask 'notion'
cask 'visual-studio-code'
cask 'sublime-text'
cask 'intellij-idea'
cask 'warp'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
#mas 'Speedtest', id: 1153157709
